package ex0621;

public class ex02상수 {

	public static void main(String[] args) {
		
		//상수 선언하기
		final int PI = 3;
		
		// 재할당 불가능 num = 10; 하면 오류남
		
		// 변수명 작성 규칙
		// 필수
		// 1. 키워드 를 변수명으로 사용불가 
		// 2. 대소문자 구분가능/ 길이제한 없음
		// 3. 숫자로 시작 불가
		// 4. 특수문자 _ $ 만 사용가능
		
		// 관습
		// 1. 패키지 이름은 전체 이름을 소문자
		// 2. 클래스 첫글자는 대문자로 시작 
		// 3. 변수 첫 글자 는 소문자
		// 4. 상수는 모두 대문자로 표시! NUM
		// 5. 여러 단어로 이루어져 있을 때 
		// 5-1. 띄어쓰기 대신 _사용하기
		// int person_age (스네이크 표기법)
		// 5-2. 다음 단어 첫 글자를 대문자로 
		// int personAge (카멜 - 낙타가 등이 굽어있어서 표기법)
		
		
		
		
		
		

	}

}
